results/2021_07_27/scenario_5/hey/TCP/raw

[mick@colossus-guardian CG]$ ./rr
===========================================
scenario_5 -- 1 sender -- test 1
===========================================

Summary:
  Total:	60.0005 secs
  Slowest:	0.0045 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2411.7810
  
  Total data:	1226255592 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [144539]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [102]	|
  0.002 [65]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0005 secs
  95% in 0.0005 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0045 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0004 secs, 0.0003 secs, 0.0039 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	144708 responses



===========================================
scenario_5 -- 1 sender -- test 2
===========================================

Summary:
  Total:	60.0005 secs
  Slowest:	0.0018 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2370.9950
  
  Total data:	1205519714 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [131777]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [10307]	|■■■
  0.001 [16]	|
  0.001 [6]	|
  0.001 [14]	|
  0.001 [116]	|
  0.001 [21]	|
  0.001 [1]	|
  0.002 [1]	|
  0.002 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0005 secs
  95% in 0.0005 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0018 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0004 secs, 0.0003 secs, 0.0011 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	142261 responses



===========================================
scenario_5 -- 1 sender -- test 3
===========================================

Summary:
  Total:	60.0011 secs
  Slowest:	0.0016 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2472.0551
  
  Total data:	1256914524 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [120411]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [27726]	|■■■■■■■■■
  0.001 [20]	|
  0.001 [7]	|
  0.001 [9]	|
  0.001 [86]	|
  0.001 [59]	|
  0.001 [3]	|
  0.001 [2]	|
  0.002 [2]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0005 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0016 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0003 secs, 0.0003 secs, 0.0015 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	148326 responses



===========================================
scenario_5 -- 1 sender -- test 4
===========================================

Summary:
  Total:	60.0010 secs
  Slowest:	0.0031 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2520.9064
  
  Total data:	1281751818 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [151062]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [33]	|
  0.001 [151]	|
  0.001 [7]	|
  0.002 [1]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [1]	|
  0.003 [1]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0031 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:	0.0003 secs, 0.0003 secs, 0.0031 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	151257 responses



===========================================
scenario_5 -- 1 sender -- test 5
===========================================

Summary:
  Total:	60.0010 secs
  Slowest:	0.0014 secs
  Fastest:	0.0003 secs
  Average:	0.0004 secs
  Requests/sec:	2521.9746
  
  Total data:	1282294154 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [114857]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [36217]	|■■■■■■■■■■■■■
  0.001 [75]	|
  0.001 [3]	|
  0.001 [4]	|
  0.001 [7]	|
  0.001 [65]	|
  0.001 [84]	|
  0.001 [6]	|
  0.001 [2]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0004 secs
  75% in 0.0004 secs
  90% in 0.0004 secs
  95% in 0.0004 secs
  99% in 0.0005 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0014 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0003 secs, 0.0003 secs, 0.0009 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [200]	151321 responses



===========================================
scenario_5 -- 10 senders -- test 1
===========================================

Summary:
  Total:	60.0012 secs
  Slowest:	0.0060 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16342.1271
  
  Total data:	8309163752 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [978494]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [1749]	|
  0.002 [283]	|
  0.003 [8]	|
  0.003 [2]	|
  0.004 [5]	|
  0.004 [3]	|
  0.005 [1]	|
  0.005 [0]	|
  0.006 [2]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0006 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0060 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:	0.0005 secs, 0.0003 secs, 0.0038 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0053 secs

Status code distribution:
  [200]	980548 responses



===========================================
scenario_5 -- 10 senders -- test 2
===========================================

Summary:
  Total:	60.0013 secs
  Slowest:	0.0224 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16568.8835
  
  Total data:	8424469470 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [994124]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [20]	|
  0.007 [0]	|
  0.009 [0]	|
  0.011 [0]	|
  0.014 [0]	|
  0.016 [0]	|
  0.018 [0]	|
  0.020 [0]	|
  0.022 [10]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0006 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0224 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0005 secs, 0.0003 secs, 0.0223 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [200]	994155 responses



===========================================
scenario_5 -- 10 senders -- test 3
===========================================

Summary:
  Total:	60.0012 secs
  Slowest:	0.0031 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16569.3585
  
  Total data:	8424689794 bytes
  Size/request:	8474 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [802068]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [190013]	|■■■■■■■■■
  0.001 [1113]	|
  0.001 [655]	|
  0.002 [257]	|
  0.002 [60]	|
  0.002 [3]	|
  0.003 [4]	|
  0.003 [4]	|
  0.003 [3]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0006 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0031 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.0005 secs, 0.0003 secs, 0.0025 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [200]	994181 responses



===========================================
scenario_5 -- 10 senders -- test 4
===========================================

Summary:
  Total:	60.0013 secs
  Slowest:	0.0039 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16734.1807
  
  Total data:	8508506128 bytes
  Size/request:	8508 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [980957]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [17739]	|■
  0.001 [926]	|
  0.002 [327]	|
  0.002 [20]	|
  0.002 [6]	|
  0.003 [6]	|
  0.003 [4]	|
  0.004 [10]	|
  0.004 [4]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0006 secs
  50% in 0.0006 secs
  75% in 0.0006 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0039 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.0005 secs, 0.0003 secs, 0.0033 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0030 secs

Status code distribution:
  [200]	1000000 responses



===========================================
scenario_5 -- 10 senders -- test 5
===========================================

Summary:
  Total:	60.0011 secs
  Slowest:	0.0039 secs
  Fastest:	0.0004 secs
  Average:	0.0006 secs
  Requests/sec:	16956.6429
  
  Total data:	8621600132 bytes
  Size/request:	8621 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [980811]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [17959]	|■
  0.001 [906]	|
  0.002 [273]	|
  0.002 [28]	|
  0.002 [10]	|
  0.003 [4]	|
  0.003 [2]	|
  0.004 [4]	|
  0.004 [2]	|


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0005 secs
  50% in 0.0006 secs
  75% in 0.0006 secs
  90% in 0.0007 secs
  95% in 0.0007 secs
  99% in 0.0008 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0004 secs, 0.0039 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0005 secs, 0.0003 secs, 0.0024 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0033 secs

Status code distribution:
  [200]	1000000 responses



[mick@colossus-guardian CG]$